# language: ru
Функция: Тестирование программы

  Предыстория: Получение файла
    Допустим запуск метода получения файла с переменными окружения из "files/test_files/test_get_file"
    Тогда получение коллекции из файла

  Сценарий: Вводится имя команды и аргументы
    Пусть тестируется случай "test1"
    Пусть тестируется случай "test2"
    Пусть тестируется случай "test3"
    Пусть тестируется случай "test4"
    Пусть тестируется случай "test5"
    Пусть тестируется случай "test6"
    Пусть тестируется случай "test7"
    Пусть тестируется случай "test8"
    Пусть тестируется случай "test9"
    Пусть тестируется случай "test10"
    Пусть тестируется случай "test11"
    Пусть тестируется случай "test12"
    Пусть тестируется случай "test13"
    Пусть тестируется случай "test14"
    Пусть тестируется случай "test15"
    Пусть тестируется случай "test16"
    Пусть тестируется случай "test17"
    Пусть тестируется случай "test18"